#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/my-terraform-aws-projects-2025/aws-terraform-2-tier-webapp/runs/run-AwrRqW3oSgr2685Q

Waiting for the plan to start...

Terraform v1.14.3
on linux_amd64
Initializing plugins and modules...
tls_private_key.main: Refreshing state... [id=0925bd75c714d8584fee647cef72e887a319f014]
module.storage.random_id.suffix: Refreshing state... [id=o5bxOg]
local_file.private_key: Refreshing state... [id=39d9d787f420834053a6eefc0fda214a1f910249]
module.storage.data.aws_elb_service_account.main: Reading...
module.ec2.data.aws_ami.latest_amazon_linux: Reading...
module.vpc.aws_iam_role.flow_log_role: Refreshing state... [id=vpc-flow-log-role]
module.vpc.aws_cloudwatch_log_group.flow_log_group: Refreshing state... [id=/aws/vpc/flow-logs-debug]
aws_key_pair.generated_key: Refreshing state... [id=project-key]
module.ec2.aws_iam_role.ec2_cloudwatch_role: Refreshing state... [id=ec2-cloudwatch-role]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-02ff0b281467e1e25]
module.ec2.aws_cloudwatch_log_group.app_log_group: Refreshing state... [id=/aws/ec2/webapp-logs]
module.storage.data.aws_elb_service_account.main: Read complete after 0s [id=127311923021]
module.vpc.data.aws_caller_identity.current: Reading...
module.storage.aws_s3_bucket.alb_logs: Refreshing state... [id=my-alb-debug-logs-a396f13a]
module.vpc.data.aws_caller_identity.current: Read complete after 0s [id=871308866502]
module.ec2.aws_ssm_parameter.cw_agent_config: Refreshing state... [id=AmazonCloudWatch-linux-webapp]
module.ec2.aws_iam_role_policy_attachment.cw_policy: Refreshing state... [id=ec2-cloudwatch-role-20260213082432041800000002]
module.ec2.aws_iam_role_policy_attachment.ssm_policy: Refreshing state... [id=ec2-cloudwatch-role-20260213082432029600000001]
module.ec2.aws_iam_instance_profile.ec2_profile: Refreshing state... [id=ec2-cloudwatch-profile]
module.vpc.aws_iam_role_policy.flow_log_policy: Refreshing state... [id=vpc-flow-log-role:vpc-flow-log-policy]
module.storage.aws_s3_bucket_public_access_block.alb_logs_public_access_block: Refreshing state... [id=my-alb-debug-logs-a396f13a]
module.storage.aws_s3_bucket_server_side_encryption_configuration.alb_logs_encryption: Refreshing state... [id=my-alb-debug-logs-a396f13a]
module.storage.aws_s3_bucket_policy.alb_log_policy: Refreshing state... [id=my-alb-debug-logs-a396f13a]
module.storage.aws_s3_bucket_versioning.alb_logs_versioning: Refreshing state... [id=my-alb-debug-logs-a396f13a]
module.storage.aws_s3_bucket_lifecycle_configuration.log_lifecycle: Refreshing state... [id=my-alb-debug-logs-a396f13a]
module.ec2.data.aws_ami.latest_amazon_linux: Read complete after 0s [id=ami-02b86da1e539b4dd0]
module.vpc.aws_default_security_group.default: Refreshing state... [id=sg-0c42dd1fdff6d1c49]
module.vpc.aws_flow_log.vpc_debug_logs: Refreshing state... [id=fl-08014988a20814265]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-041bfc4b7ec1e3911]
module.vpc.aws_internet_gateway.igw: Refreshing state... [id=igw-016d59adf0493fabc]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-02da4f0d8f2cbd95b]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-069ecfb32217c799c]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-096590ce0e21055d0]
module.security_groups.aws_security_group.alb_sg: Refreshing state... [id=sg-06b73ee87bde6e8e2]
module.alb.aws_lb_target_group.app_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:871308866502:targetgroup/app-tg20260213082443359900000004/5de347e53d45d589]
module.vpc.aws_route_table.public_rt: Refreshing state... [id=rtb-0b9bbfa6577fd6317]
module.security_groups.aws_security_group.ec2_sg: Refreshing state... [id=sg-0b6dbf5efd824e629]
module.rds.aws_db_subnet_group.rds_subnet_group: Refreshing state... [id=main-rds-subnet-group]
module.alb.aws_lb.application_lb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:871308866502:loadbalancer/app/webapp-2-tier-alb/241182bfa93a49f2]
module.vpc.aws_route_table_association.public_assoc[0]: Refreshing state... [id=rtbassoc-0b108ad4bea4d4cd6]
module.vpc.aws_route_table_association.public_assoc[1]: Refreshing state... [id=rtbassoc-05ba1526fc4fc3db0]
module.security_groups.aws_security_group.rds_sg: Refreshing state... [id=sg-0cf6358e776762f48]
module.alb.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:871308866502:listener/app/webapp-2-tier-alb/241182bfa93a49f2/f76e9a06083ed0ec]
module.rds.aws_db_instance.mysql: Refreshing state... [id=db-EDDDTDACVU7IZRKJJ5WSEP5XGM]
module.ec2.aws_launch_template.app_lt: Refreshing state... [id=lt-04db2abec0e154425]
module.ec2.aws_autoscaling_group.app_asg: Refreshing state... [id=webapp-asg]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # local_file.private_key will be created
  + resource "local_file" "private_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0400"
      + filename             = "./project-key.pem"
      + id                   = (known after apply)
    }

  # module.ec2.data.aws_instances.asg_instances will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_instances" "asg_instances" {
      + id                   = (known after apply)
      + ids                  = (known after apply)
      + instance_state_names = [
          + "running",
        ]
      + instance_tags        = (known after apply)
      + ipv6_addresses       = (known after apply)
      + private_ips          = (known after apply)
      + public_ips           = (known after apply)

      + filter {
          + name   = "tag:Name"
          + values = [
              + "ASG-Web-Server",
            ]
        }
    }

  # module.ec2.aws_autoscaling_group.app_asg will be updated in-place
  ~ resource "aws_autoscaling_group" "app_asg" {
        id                               = "webapp-asg"
        name                             = "webapp-asg"
        # (31 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-04db2abec0e154425"
            name    = "webapp-launch-template-20260213083248064900000007"
          ~ version = "1" -> (known after apply)
        }

        # (7 unchanged blocks hidden)
    }

  # module.ec2.aws_launch_template.app_lt will be updated in-place
  ~ resource "aws_launch_template" "app_lt" {
        id                                   = "lt-04db2abec0e154425"
      ~ latest_version                       = 1 -> (known after apply)
        name                                 = "webapp-launch-template-20260213083248064900000007"
        tags                                 = {}
      ~ user_data                            = (sensitive value)
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ ec2_instance_ids     = [] -> (known after apply)
  ~ ec2_public_ips       = [] -> (known after apply)

------------------------------------------------------------------------

Cost estimation:

Resources: 3 of 9 estimated
           $34.4888000000000016/mo +$0.0

```

</details>